[
  {
    "Name": "The Magic of Protection Stones",
    "Slug": "the-magic-of-protection-stones",
    "Collection ID": "6081d8544a52aeb093ea31b0",
    "Item ID": "62d1a6d73b2cdfc98ecc58af",
    "Created On": "Fri Jul 15 2022 17:41:43 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Fri Jul 15 2022 19:53:28 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Fri Jul 15 2022 19:54:22 GMT+0000 (Coordinated Universal Time)",
    "Thumbnail": "https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a60d1ed7e9246a162b68_Screen%20Shot%202022-07-15%20at%201.12.04%20AM.png",
    "Full-Size-Image": "https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a60d1ed7e9246a162b68_Screen%20Shot%202022-07-15%20at%201.12.04%20AM.png",
    "Content": "<h1 id=\"\">The Magic of Protection Stones</h1><p id=\"\">A little magic goes a long way, especially when it comes to protection. Natural stones and crystals have been used for centuries to provide defense against negative energy and vibes. In this modern world, we often forget the power of nature and the importance of staying connected to the earth. But when you're looking for some extra armor in your everyday life, turn to protection stones. Here are six of the best that can help you stay safe and protected:&nbsp;</p><h2 id=\"\">Protection stones include:</h2><h3 id=\"\">1) <strong id=\"\">Amethyst</strong>:&nbsp;</h3><p id=\"\">Amethyst is a popular choice for protection stones. It is said to create a bubble of spiritual protection around the wearer, as well as shielding them from negative energy. Amethyst is also thought to be helpful in warding off depression and addiction. This purple crystal is hand-selected for each bracelet. Each bracelet is made with love in Corvallis, Oregon.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:783px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"783px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a58d9af51dbcdeeee4e6_GQiU8UxlTbgfvA_eRmfP81f8NOwybNGmMNKjjoY0jDiXM8_89HpV1ehL3M5GY6QzObMSGLd7qeMYk_fqq25uKI0Aj9ChWFaECLZ6R0soeJXEcaVqphlsWkSNmZAJj5I3SSS484x6YYDA3-G3v7ZB_c4.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><blockquote id=\"\">Anything is magic if you have the intention. <a href=\"/shop\">Click Here to shop our store</a></blockquote><h3 id=\"\">2) <strong id=\"\">Tigers Eye</strong>:&nbsp;</h3><p id=\"\">Tigers Eye is a type of protection stone that has been used throughout history for its ability to offer both physical and psychic protection. Tigers Eye is said to be particularly helpful in deflecting negative energy and illness. Tigers Eye is also believed to promote courage, strength, and confidence. In the crystal healing tradition, Tigers Eye is often used to balance the chakras and provide grounding and stability. Tigers Eye can be worn as jewelry or carried as a talisman.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:783px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"783px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a58d9a75648532924259_uN15FS_6hRMSM_2nL2FJ97DZr8-czcOt2r9pvrP2UVbdBKnYW-9FcrerbK8WAuIoLCG3ulwws7Dxz0Y4vgYV-4kLuFFxY64ng9AdsnqXAsCgEmqAzjDN9W0VhPU3CO8yn3LapQKLkGBYGhIzlM0.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\"\">3) <strong id=\"\">Smokey Quartz</strong>:&nbsp;</h3><p id=\"\">Smokey Quartz is a popular choice for jewelry and other decorative items because of its beauty and its purported healing properties. In crystal healing, Smokey Quartz is said to be helpful for grounding and protection. It is also said to promote concentration and focus, making it a good choice for students or anyone who needs a little extra help staying on task.&nbsp;</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:783px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"783px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a58edd7d655fec100d3d_d0QBbMopgI2GH17-d53iVX6Hl4jy6egaYehhX8DiMRf2dA-YlbdprTadCQfUoz1sCHxhJbBY5gBjDqyvoFIEn2xQrDGSq3AobU0bZbQ1DFNCLCRoebjGKtZoiSzNXjUv6gJx0FRF9kx0ezr-frQ.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><blockquote id=\"\">Anything is magic if you have the intention. <a href=\"/shop\">Click Here to shop our store</a></blockquote><h3 id=\"\">4) <strong id=\"\">Obsidian</strong>:&nbsp;</h3><p id=\"\">Obsidian is a popular choice for crystal healing and protection stones. It is a type of volcanic glass with a rich history dating back to ancient times. Obsidian was used by many cultures for making tools, weapons, and jewelry. It is still used today for a variety of purposes, including making bracelets, pendants, and other handcrafted jewelry. Obsidian is said to have powerful protective qualities. It is thought to deflect negativity and help to shield the wearer from harm. Obsidian is also believed to promote inner strength and courage. For these reasons, it is an excellent stone to use for protection and healing.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:783px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"783px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a58da52fb434c92ed573_mpZAZN_OdMnGIhuuG9JjwYJ6-gIyQgRjXzpvRhbEQFaWC5eMA0ITwDSiBmZ2UbGGRanZt7E5FSn4R7QFr6v0xJtJI1WsYU73nHR0N8zu6HEY7X1u424kQgafD6YACaqa3QhxxqyOMKly9KZrcAw.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h3 id=\"\">5) <strong id=\"\">Labradorite</strong>:&nbsp;</h3><p id=\"\">Labradorite is a beautiful, iridescent stone that has been used for centuries for its protective properties. It is said to deflect negative energy and to boost the wearer's own energy field. Labradorite is also believed to connect the wearer to their higher self, and to promote spiritual growth. Labradorite bracelets are traditionally hand-made, and each bracelet is unique. The stones are carefully selected for their size, shape, and color. The bracelet is then strung on a durable cord and finished with a secure clasp. Labradorite bracelets make thoughtful gifts for friends and loved ones, and can be worn as a reminder to stay positive and connected to your highest self.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:783px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"783px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62d1a58ebf5ab693595bcc66_pC-onblpw-G3cDjSmPqJfZ26ELZB4ATnc1cGuHtjzqC8C9O60dTyWRAJWO_WEylGWPs1oKeYEeIykA5Ez8Q2SW1og7rg_XidX5LlNQfhZR4Yi3-otJXXzR8y0qmAKkYnslL2mXgl4YndgWBzU9E.png\" id=\"\" width=\"auto\" height=\"auto\" loading=\"auto\"></div></figure><h2 id=\"\">Conclusion:&nbsp;</h2><p id=\"\">If you are looking for a little extra protection in your life, consider adding one of these stones to your jewelry collection. You can find our beautiful and unique protection stones in the form of a hand-made bracelet or necklace at our online store. With so many different crystals and gemstones to choose from, we are sure you will find the perfect piece to help keep you safe and protected.</p><p>‍</p><p id=\"\"><a href=\"/shop\">Click here to shop our collection</a></p>",
    "Category": "basics",
    "Tags": "",
    "Custom-Date": "Wed Jun 15 2022",
    "Featured?": true,
    "Stone Type": "amethyst; tigers-eye; smokey-quartz; obsidian; labradorite"
  },
  {
    "Name": "Tigers Eye: The Stone of Willpower",
    "Slug": "tigers-eye-the-stone-of-willpower",
    "Collection ID": "6081d8544a52aeb093ea31b0",
    "Item ID": "6081d8544a52aeca2dea327c",
    "Created On": "Tue Mar 05 2019 16:35:12 GMT+0000 (Coordinated Universal Time)",
    "Updated On": "Fri Jul 15 2022 18:03:48 GMT+0000 (Coordinated Universal Time)",
    "Published On": "Fri Jul 15 2022 18:03:48 GMT+0000 (Coordinated Universal Time)",
    "Thumbnail": "https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/6242887b8cc16a4d5b5dae1e_blog-thumbnail-tigers-eye-the-stone-of-willpower.jpg",
    "Full-Size-Image": "https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/6242887b8cc16a4d5b5dae1e_blog-thumbnail-tigers-eye-the-stone-of-willpower.jpg",
    "Content": "<p>If you're looking for a way to boost your willpower and achieve your goals, then tigers eye jewelry might be just what you need! This unique and beautiful gemstone is known for its ability to help you stay focused and motivated. Plus, its beautiful design makes it a great addition to any outfit. So if you're looking for some extra motivation or just a beautiful fashion piece, be sure to check out tigers eye!</p><h2>1. What is Tigers Eye crystal and where does it come from?</h2><p>Tigers Eye is a type of crystal that is known for its distinctive yellow and brown stripes. It is found in a number of locations around the world, including South Africa, Australia, and the United States. Tigers Eye is usually found in sedimentary rock formations, and the crystals are formed through a process of metamorphism. During this process, the original rock is heated and compressed, causing the minerals to recrystallize. This gives Tigers Eye its unique striped appearance. The name Tigers Eye comes from the belief that the patterns on the crystal resemble those of a tiger's eye. Tigers Eye is thought to have a number of magical properties, including the ability to ward off evil spirits and bring good luck.</p><ul><li>Tigers Eye is a stone of protection that is also said to help one see clearly. It enhances intuition, psychic powers and promotes insight.</li><li>Tigers Eye is grounding and stabilizing, providing courage and self-confidence. It has been used to deflect negative energy and is helpful in situations where there is conflict or aggression.</li><li>This beautiful crystal can be worn as jewelry or carried as a stone for good luck, longevity, wealth and prosperity.</li></ul><p>If you are looking for a way to boost your energy or if you want to start working with crystals, tigers eye may be the right choice for you. You can find tigers eye in a variety of places, but our website offers some of the best prices on the internet. <a href=\"/about\">Be sure to check us out today!</a></p><h2>2. The metaphysical properties of Tigers Eye crystal</h2><p>Tigers Eye is a beautiful, golden-brown gemstone with brilliant bands of color. It is said to have metaphysical properties that can help one to connect with the earth and find their OWN power, courage, and strength. Tiger's Eye is found in metamorphic rock and is composed of fibrous quartz crystals. </p><blockquote>\"The unique appearance of this gemstone is due to the parallel arrangement of these crystals, which reflect light in a chatoyant manner (similar to a cat's eye).\" </blockquote><p>Due to its unique appearance and purported metaphysical properties, <a href=\"/shop\">Tigers Eye has been used in jewelry</a>, sculptures, and carvings for centuries. Today, it is still a popular choice for those seeking earthy, grounding energy.</p><ul><li>attracts abundance and prosperity, while also promoting courage and strength</li><li>wards off negative energies and protects from harm</li><li>stabilizes moods, providing a sense of calm during chaotic times</li><li>stimulates the Solar Plexus chakra, which is responsible for personal power and self-confidence</li></ul><p>If you’re looking for a stone to help you stay motivated and driven, Tigers Eye might be the right choice for you. You can also use this crystal to improve your business dealings and attract new customers. <a href=\"/shop\">Visit our website to purchase tigers-eye crystals today!<br></a></p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1600px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1600px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/6242879e7b153033bfe4ca9e_blog-thumbnail-How%20to%20use%20Tigers%20Eye%20for%20manifestation.jpg\" loading=\"lazy\" width=\"auto\" height=\"auto\"></div></figure><h2>3. How to use Tigers Eye for spiritual healing</h2><p>tigers eye crystal is known for its ability to help the user find balance, courage, and strength in difficult times. It is said to promote clarity of thought and to help with making decisions. Tigers eye can also be used for protection, as it is believed to ward off negativity and evil spirits. When used for spiritual healing, tigers eye can help to connect the user with their animal totem or spirit guide. It is also said to be helpful in past life regression work. To use tigers eye for spiritual healing, it is recommended that you meditate with the stone or carry it with you throughout the day. You can also place it in your environment, <a href=\"/about\">such as on your altar or near your bed</a>. Remember that when using crystals for healing, it is...</p><ul><li>Brings focus and clarity to the mind</li><li>Boosts stamina and energy levels</li><li>Protects from negative thoughts and energy</li><li>Good luck charm for success in business and personal ventures</li></ul><p>So if you're feeling nervous about applying for a new job or asking for a raise, keep a piece of Tiger's Eye in your pocket for added confidence. In addition to its boost in courage, <a href=\"/blog-categories/lifestyle\">Tiger's Eye is also physically strengthening</a>, making it an ideal stone for athletes or anyone who wants to increase their stamina. Whether you're looking to make a strong first impression or simply want to feel more confident and empowered, let Tiger's Eye be your guide.</p><h2>4. The benefits of wearing Tigers Eye jewelry</h2><p>Tiger Eye is quite beneficial to bring focus in mind. It also improves the stamina and re-energizes the senses. It helps the wearer to stay grounded and eradicates the doubts from the mind. It is, in fact, a good luck bringing stone that protects the wearer from evil thoughts and ill wishes of enemies. The most common colors of this gemstone are golden and honey-brown, which laced with bands of black. The bands in the Tiger Eye may appear straight or curved, but they always form parallel lines. The chatoyancy effect in TigerEye is due to the reflection of light from parallel fibrous inclusions within the gemstone. <a href=\"/blog/how-to-use-crystals-for-healing\">Wearing this gemstone as a pendant or ring can help in keeping your energies </a>grounded.</p><ul><li>Brings focus and clarity to the mind</li><li>Boosts stamina and energy levels</li><li>Protects from negative thoughts and energy</li><li>Good luck charm for success in business and personal ventures</li></ul><blockquote>\"Tiger eye is a semiprecious silicate mineral that is usually a metamorphic rock with a golden to red-brown color and a chatoyant luster. \"</blockquote><p>Tiger eye is also popular as a gemstone. It has been used in jewelry for centuries. The most common place to find tiger eye is in South Africa, but it can also be found in Australia, Brazil, China, India, and the United States. The name “tiger eye” comes from the way the mineral looks when it is cut and polished. The stripes of color resemble those of a tiger’s eye.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1600px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1600px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62428b177794bd3f6e063c67_blog-thumbnail-tigers-eye-the-stone-of-willpower.jpg\" loading=\"lazy\" width=\"auto\" height=\"auto\"></div></figure><h2>5. How to choose the right piece of Tigers Eye jewelry for you</h2><p>Do you love the look of Tigers Eye jewelry, but don't know how to choose the right piece for you? Let us help help! Tigers Eye is a gorgeous gemstone that comes in a variety of colors and styles, making it the perfect choice for any outfit or occasion.</p><p>Tiger's Eye is a bold and assertive stone. It can help you stand up for yourself and get the recognition you deserve. Have a piece in your pocket when applying for a job or asking for a raise. Tiger's Eye also is a very physically strengthening stone too. It is said to increase determination, courage, confidence and will power.All of these things together make it an excellent stone to have around when you are taking charge, whether it be at work or in your personal life. </p><blockquote>\"Wearing or carrying Tiger's Eye can also help one feel more centered and grounded. <a href=\"/blog-tags/instagram\">You may find yourself being calmer and more rational in situations</a> that would normally make you nervous or cause you to react emotionally. If you are prone to self-doubt\"</blockquote><ul><li>Stone of courage and determination</li><li>Increases will power and confidence</li><li>physically strengthening stone</li><li>Good for job applications or negotiations</li></ul><p>Tiger's Eye is also a very physically strengthening stone. If you are recovering from an illness or injury, or if you are undertaking a challenging physical task, carrying a piece of Tiger's Eye will give you the strength and endurance you need to see it through. In all these ways, Tiger's Eye is an invaluable stone to have on your side.</p><figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1140px\" data-rt-type=\"image\" data-rt-align=\"fullwidth\" data-rt-max-width=\"1140px\"><div><img src=\"https://uploads-ssl.webflow.com/6081d8544a52ae38abea31b6/62428b7ac64a9781e6e5ded7_Tiger%27s%20Eye%20%2B%20Rosewood.png\" loading=\"lazy\" width=\"auto\" height=\"auto\"></div></figure><p>‍</p><p>Tigers eye is a powerful stone that has many benefits for the body, mind, and spirit. It can be used to promote healing, manifest desires, and increase intuition. If you are looking for a stone that will help you connect with your intuition and manifest your desires, tigers eye may be the right choice for you. <a href=\"/shop\">Visit our website</a> to learn more about this amazing gemstone and purchase your own tigers eye crystals today!</p><p>Worn as protection in many cultures for centuries, Tigers Eye is one powerful and captivating stone. This brown and gold striped mineral is said to give the wearer willpower, focus, confidence and practicality. tigers eye jewelry is an excellent way to bring the power of this stone with you wherever you go! </p>",
    "Category": "basics",
    "Tags": "beauty; event; instagram",
    "Custom-Date": "Wed Jun 15 2022",
    "Featured?": true,
    "Stone Type": "tigers-eye"
  }
]
